benchmarks/results/json_api_wrk.txt
Running 5s test @ http://127.0.0.1:8088/
  2 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   744.65us    0.94ms  12.22ms   94.15%
    Req/Sec    17.12k     2.80k   26.45k    59.41%
  Latency Distribution
     50%  530.00us
     75%  629.00us
     90%    0.93ms
     99%    5.52ms
  171997 requests in 5.10s, 30.18MB read
Requests/sec:  33728.15
Transfer/sec:      5.92MB